{
  "intro1": "Olá",
  "intro2": "eu sou",
  "name": "Giuan Ferreira",
  "photo": "https://avatars.githubusercontent.com/u/76171709?v=4",
  "job": "Dev Front-end",
  "location": "Sliema - MT",
  "phone": "+55 85 98207-2650",
  "email": "giuanm@live.com",
  "graduation1": "Estatística e Matemática Aplicada - UFC",
  "graduation2": "Análise e Desenvolvimento de Sistemas - UNINASSAU",
  "salutation": "Olá! Apenas para fins de personalização das páginas seguintes, você poderia se identificar?",
  "aboutme": "Explorador da vida em busca de novas experiências e aprendizados. Apaixonado por dança de salão (tango, zouk, forró e bachata), cozinhar, viajar, fazer novas amizades e dedicado a sempre aprender e conhecer algo novo. Atualmente moro em Malta até Fevereiro/2024. Graduado em Estatística e Matemática Aplica, Análise e Desenvolvimento de Sistemas. 2023 foi o ano que tirei para viver uma nova fase, viajar por muitos lugares, aprender Inglês, conhecer muita gente e poder compartilhar experiencias/cultura. Acredito no poder da positividade e no crescimento pessoal contínuo, adoro colocar em prática o que aprendo com Programação Neuro Linguistica (PNL). Sempre em busca de desafios e oportunidades para aprender e evoluir.",
  "aboutmeProfessional": "Olá, eu sou o Giuan, um profissional apaixonado por tecnologia e inovação, mais tecnicamente por desenvolvimento front-end e back end. Formação em Analise de Sistemas e Estatística, com percurso de carreira desenvolvido na coordenação de projetos BPO em grandes empresas dos setores de energia (Enel) e bancário (Caixa Econômica Federal). Doze anos de experiência na área de planeamento de sistemas de tráfego/atendimento, responsável pela coordenação, liderança e acompanhamento de projetos, assim como desenvolvimento de novos produtos e melhoria de processos e serviços. Gestão econômica dos projetos, com ampla interface com as áreas de negócios e IT. Relacionamento com múltiplos stakeholders, atuando em função de PO e coordenação de projetos. Experiência como web developer, em projetos independentes de construção de sites, com prática em JavaScript, Python e React. Vivência internacional, em intercâmbio de estudo e trabalho na Irlanda e em Malta.",
  "desPersonality1": "Os Apoiadores (INFJ) podem ser o tipo de personalidade mais raro de todos, mas certamente não passam despercebidos. Idealistas e firmes em seus princípios, não basta viver uma vida sem grandes desafios, eles querem fazer a diferença com suas ações. Para alguém com a personalidade do Apoiador, o sucesso não significa dinheiro ou status, mas sim buscar realização, ajudar os outros e contribuir para mudanças positivas no mundo.",
  "desPersonality2": "Apesar de terem grandes objetivos e ambições, os Apoiadores estão longe de ser sonhadores passivos. Pessoas com esse tipo de personalidade dão importância à integridade e só ficam satisfeitas quando fazem o que julgam ser certo. Escrupulosos até a alma, eles vivem com uma compreensão clara dos seus valores e buscam sempre focar no que é essencial, mas não para os outros ou a sociedade, e sim de acordo com a sua própria sabedoria e intuição.",
  "typePersonality": "Apoiador - INFJ-A / INFJ-T",
  "nameCamp": "Nome",
  "company": "Empresa",
  "professional": "Profissional",
  "experienceCamp": "Experiência",
  "project": "Projetos",
  "projectDesc": "Nos ultimos anos venho desenvolvendo alguns projetos e publicando em meu GitHub. Logo abaixo vou disponibilizar alguns desses projetos e seus links para que possam ser visualizados juntamente com seus repositorios do GitHub. Caso tenham algum feedback, por favor me enviem por meio de um dos meus contatos disponiveis aqui na página.",
  "personal": "Pessoal",
  "aboutme_camp": "Sobre mim",
  "personality": "Personalidade",
  "nlp": "PNL - Programação Neurolinguística",
  "nlpD1": "A Programação Neurolinguística (PNL) é uma abordagem que explora a relação entre os processos neurológicos (neuro-), a linguagem (linguística) e os padrões comportamentais aprendidos através da experiência (programação). A PNL tem como objetivo compreender como as pessoas estruturam sua experiência subjetiva do mundo e, a partir disso, desenvolver técnicas para melhorar a comunicação, o comportamento e a performance pessoal.",
  "nlpD2": "Exemplos de benefícios da PNL incluem:",
  "nlpE1": "Melhoria na Comunicação: A PNL oferece ferramentas para aprimorar a comunicação interpessoal, ajudando as pessoas a compreender e utilizar padrões linguísticos mais eficazes.",
  "nlpE2": "Gestão de Emoções: A PNL auxilia na compreensão e gestão de emoções, permitindo que as pessoas desenvolvam estratégias para lidar com situações desafiadoras de maneira mais eficaz.",
  "nlpE3": "Estabelecimento de Metas Eficazes: A PNL fornece técnicas para ajudar na definição de metas claras e no desenvolvimento de estratégias para alcançá-las.",
  "nlpE4": "Negociação Eficaz: Técnicas de PNL são frequentemente aplicadas em contextos de negociação para melhorar a persuasão e influência, aumentando a eficácia nas interações comerciais.",
  "nlpE5": "Aprimoramento do Desempenho Profissional: A PNL é aplicada em contextos profissionais para otimizar o desempenho de líderes, equipes e indivíduos, promovendo um ambiente de trabalho mais produtivo.",
  "hobbies": "Hobbies",
  "danc": "Dançar",
  "danca": "Um dos meus principais hobbies é dançar. Adoro uma dança de salão, meus favoritos são Tango, Forró, Bachata e Zouk. Desde que assisti uma aula demonstrativa em 2010, fiquei fascinado e não consegui resisti, apesar de nunca antes ter dançado, eu era muito desajeitado e não conseguia nem se quer iniciar um passo mais simples. Me dediquei até conseguir acompanhar a turma e dai em diante passei a conhecer muitas outras danças, começando por Forró, Zouk e Bachata. Depois passei para Bolero, Salsa, Samba, Tango, Soltinho, West Coast Swing (WCS), Roda de Cassino, Merengue e Kizomba. Foram muitos anos e amigos feitos atravez da dança. Hoje ainda continuo, não com a frequencia que tinha, mas sempre que vejo uma oportunidade de poder dançar com os meus quatro favoritos.",
  "tango": "O tango é uma dança parceira e social que se originou na década de 1880 ao longo do Río de la Plata, fronteira natural entre Argentina e Uruguai. O tango nasceu nas empobrecidas áreas portuárias desses países a partir de uma combinação de celebrações da milonga argentina, da habanera hispano-cubana e do candombe uruguaio. Era frequentemente praticado nos bordéis e bares dos portos, onde os empresários empregavam bandas para entreter os seus clientes. Depois se espalhou para o resto do mundo. Muitas variações desta dança existem atualmente em todo o mundo. Em 31 de agosto de 2009, a UNESCO aprovou uma proposta conjunta da Argentina e do Uruguai para incluir o tango nas Listas do Patrimônio Cultural Imaterial da UNESCO.",
  "zouk": "O zouk brasileiro evoluiu a partir da dança parceira conhecida como lambada. À medida que o gênero musical Lambada saiu de moda, os dançarinos da Lambada recorreram ao zouk caribenho (do francófono, Ilhas do Caribe) como sua música preferida. Foi essa transição que deu origem à dança conhecida como zouk brasileiro. O termo zouk brasileiro foi adotado para distinguir o estilo de dança do gênero musical zouk caribenho. Hoje em dia o termo zouk é comumente usado para se referir ao estilo de dança zouk brasileiro.",
  "bachata": "A Bachata também conhecido com seresta, é um gênero musical e uma dança originada na República Dominicana na década de 1960. Considerada um híbrido do bolero (sobre tudo, o bolero rítmico) com outras influências musicais como o chá-chá-chá e o tango. O bolero ritmo latino-americano no período de 1930 à 1950 fazia o prazer do povo dominicano e, com esta influência, nasceu a bachata no final da década de 1950, mas apenas na década de 1980 foi reconhecido e lançada mundialmente a fim de aumentar o turismo na ilha.",
  "forro": "Forró é uma festa originária do estado de Pernambuco e disseminada na Região Nordeste do Brasil, muito popular e comum, especialmente nas festas juninas. O nome da festa forró é usado para nomear distintos gêneros musicais como o xote, baião, 'arrasta-pé' e o xaxado, por tanto quem não conhece suas histórias, as confundem com um gênero único. As músicas são executadas tradicionalmente por tres instrumentais como acordeão (Sanfona), zabumba e triângulo. Forró também é um dos gêneros musicais da festa forró, o qual foi criado por Luiz Gonzaga em 1958. A dança do xote (dois pra lá e dois pra cá) passou a acompanhar as músicas desse novo gênero e a ser chamada de dança do forró.",
  "faroPT": "Faro é um município, cidade mais meridional e capital do distrito com o mesmo nome, na região do Algarve, no sul de Portugal. Com uma população estimada em 60.995 habitantes em 2019 (com 39.733 habitantes na própria cidade, o que a torna a maior cidade e o segundo município mais populoso do Algarve (depois de Loulé) e um dos maiores do Sul de Portugal), o município cobre uma área de cerca de 202,57 km2.",
  "lisbonPT": "Lisboa é a capital e maior cidade de Portugal, com uma população estimada de 548.703 habitantes dentro dos seus limites administrativos numa área de 100 km2. Lisboa é a capital mais ocidental da Europa continental (a segunda no geral, depois de Reykjavik) e a única ao longo da costa atlântica, estando as outras (Reykjavik e Dublin) em ilhas. Lisboa é uma das cidades mais antigas do mundo e a segunda capital europeia mais antiga (depois de Atenas), antecedendo em séculos outras capitais europeias modernas. Após a queda do Império Romano, foi governado por uma série de tribos germânicas a partir do século V, principalmente os visigodos. Mais tarde foi capturada pelos Mouros no século VIII. Em 1147 Afonso Henriques conquistou a cidade e em 1255 tornou-se capital de Portugal, substituindo Coimbra. Desde então, tem sido o centro político, econômico e cultural do país.",
  "lisbon": "Lisboa",
  "london": "Londres",
  "londonDesc": "Londres é a capital da Inglaterra e do Reino Unido. Por dois milénios, foi um grande povoado e sua história remonta à sua fundação pelos romanos, quando foi nomeada Londínio. Londres é uma importante cidade global (ao lado de Nova Iorque, Tóquio e Paris) e é um dos maiores, mais importantes e influentes centros financeiros do mundo. O centro de Londres abriga a sede de mais da metade das 100 melhores companhias do Reino Unido (o índice FTSE 100) e mais de 100 das 500 maiores da Europa. Londres possui forte influência na política, finanças, educação, entretenimento, mídia, moda, artes e cultura em geral, o que contribui para a sua posição global. É um importante destino turístico para visitantes nacionais e estrangeiros. Londres sediou os Jogos Olímpicos de Verão de 1908, 1948 e 2012.",
  "dublin": "Dublin é a capital e maior cidade da Irlanda. O nome em inglês deriva da palavra irlandesa Dubhlinn, que significa Lago Negro. Tem uma população de 592 mil habitantes na cidade, e sua área metropolitana tem 1 263 219 habitantes. Fundada como um assentamento viquingue, foi o centro do Reino de Dublin e se tornou a principal cidade da Ilha após a invasão dos Normandos. A cidade cresceu de maneira rápida durante o século XVII; se tornou na época a segunda maior cidade do Império Britânico e a quinta maior da Europa. Dublin entrou em um período de estagnação após o Ato de União de 1800, mas continuou o centro econômico da Ilha. Após a Partição da Irlanda em 1922, virou a capital do Estado Livre Irlandês, e mais tarde, da República da Irlanda.",
  "malta": "Malta, oficialmente República de Malta, é um país insular localizado no Sul da Europa, cujo território ocupa as Ilhas Maltesas, um arquipélago situado no Mar Mediterrâneo, 93 km ao sul da ilha da Sicília (Itália) e 288 km a nordeste da Tunísia (África), 1 826 km a leste de Gibraltar e 1 510 km a oeste de Alexandria. Malta abrange uma área terrestre de 316 km², sendo um dos menores países da Europa, possuindo também a maior densidade demográfica do continente. Sua capital é Valeta e a maior cidade é Birkirkara. O Maltês é a língua nacional e o inglês é a língua co-oficial. Devido aos eventos históricos que se passaram ao longo dos anos, Malta tornou-se um país anglo-latino, pelas principais influências dos Impérios Romano e mais tarde Britânico, apesar de existir influências menores deixadas por outros reinos que passaram por Malta, como a Grécia e os Impérios Islamico e Bizantino e mais tarde a presença dos espanhóis e franceses. Malta é um dos países mais estratégicos na Europa e para a OTAN, como a Itália, Portugal, Turquia e outros. Malta também pode ser considerada como país anglo-latino por algumas parecenças do Maltês com outras línguas latinas e até com o próprio Latim, e também pela utilização do inglês por parte de alguns cidadãos, pela influência deixada pelos britânicos.",
  "pokedexDesc": "Qual o seu Pokemon favorito? Agora você pode procura-lo e saber suas principais informações aqui nessa página. São mais de 200, caso você não o encontre pode me acionar que verifico onde ele está, tenho certeza que será uma boa cassada 😂",
  "ToDoDesc": "Faro é um município, cidade mais meridional e capital do distrito com o mesmo nome, na região do Algarve, no sul de Portugal. Com uma população estimada em 60.995 habitantes em 2019 (com 39.733 habitantes na própria cidade, o que a torna a maior cidade e o segundo município mais populoso do Algarve (depois de Loulé) e um dos maiores do Sul de Portugal), o município cobre uma área de cerca de 202,57 km2.",
  "secretDesc": "Faro é um município, cidade mais meridional e capital do distrito com o mesmo nome, na região do Algarve, no sul de Portugal. Com uma população estimada em 60.995 habitantes em 2019 (com 39.733 habitantes na própria cidade, o que a torna a maior cidade e o segundo município mais populoso do Algarve (depois de Loulé) e um dos maiores do Sul de Portugal), o município cobre uma área de cerca de 202,57 km2.",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "React",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/react.png"
      },
      {
        "name": "Node",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/nodejs.png"
      },
      {
        "name": "Mysql",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/mysql.png"
      },
      {
        "name": "MongoDB",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/mongodb.png"
      },
      {
        "name": "GitHub",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
      }
    ],
    "softSkills": [
      "Empatia",
      "Liderança",
      "Trabalho em equipe",
      "Flexibilidade",
      "Organização"
    ]
  },
  "language": "Idiomas",
  "languages": [
    "Português BR (nativo)",
    "Inglês (B1)",
    "Espanhol (A1)"
  ],
  "descPortfolio": "Portfólio",
  "portfolio": [
    {
      "name": "Projeto realizado no bootcamp da DIO para a criação de uma Pokedex consumindo uma API para a consulta das informações dos pokemons",
      "url": "https://github.com/giuanm/Pokedex",
      "github": true
    },
    {
      "name": "Projeto realizado no bootcamp da DIO para a criação de uma página de portfolio e feito deploy por meio do GitHub",
      "url": "https://github.com/giuanm/js-developer-portfolio",
      "github": true
    },
    {
      "name": "Projeto realizado no bootcamp da DIO para a criação de fonte de pesquisa de reposiórios no GitHub",
      "url": "https://github.com/giuanm/Wiki_Git.git",
      "github": true
    }
  ],
  "experience": "Experiência Profissional",
  "professionalExperience": [
    {
      "name": "Gestor de Planejamento / Indra - Minsait",
      "period": "08/2015 - 01/2023",
      "description": "Foi um prazer implantar projetos, trabalhar e desenvolver diversos analistas para ter um senso crítico e encontrar soluções."
    },
    {
      "name": "Gestor de Planejamento / Plansul",
      "period": "01/2015 - 07/2015",
      "description": "Aqui tive minha primeira opotunidade como gestor, trabalhar e desenvolver a equipe de analistas para ter um senso crítico e encontrar soluções."
    },
    {
      "name": "Analista de Planejamento / Indra - Minsait",
      "period": "05/2011 - 10/2014",
      "description": "Nesse projeto iniciei minha jornada como analista de planejamento, colocando em prática alguns conhecimentos de Estatística e aperfeiçoando minhas análises de dados."
    }
  ],
  "contactForm": "Contato",
  "contact": [
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/giuan/",
      "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/giuanm",
      "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
    }
  ],
  "targetingMsg": "Por onde você gostaria de iniciar?"
}
