{
  "intro1": "Hello",
  "intro2": "I'm",
  "name": "Giuan Ferreira",
  "photo": "https://avatars.githubusercontent.com/u/76171709?v=4",
  "job": "Dev Front-end",
  "location": "Sliema - MT",
  "phone": "+55 85 98207 2650",
  "email": "giuanm@live.com",
  "graduation1": "Statistics and Applied Mathematics - UFC",
  "graduation2": "Analysis and Systems Development - UNINASSAU",
  "salutation": "Hello! Just for personalization purposes on the following pages, could you identify yourself?",
  "aboutme": "Life explorer in search of new experiences and learning. Passionate about ballroom dance (tango, zouk, forró, and bachata), cooking, traveling, making new friends, and dedicated to always learning and discovering something new. Currently living in Malta until February 2024. Graduated in Statistics and Applied Mathematics, Analysis and Systems Development. 2023 was the year I took to live a new phase, traveling to many places, learning English, meeting many people, and being able to share experiences/culture. I believe in the power of positivity and continuous personal growth, love to put into practice what I learn from Neuro-Linguistic Programming (NLP). Always in search of challenges and opportunities to learn and evolve.",
  "desPersonality1": "Advocates (INFJs) may be the rarest personality type of all, but they certainly leave their mark on the world. Idealistic and principled, they aren’t content to coast through life – they want to stand up and make a difference. For Advocate personalities, success doesn’t come from money or status but from seeking fulfillment, helping others, and being a force for good in the world.",
  "desPersonality2": "While they have lofty goals and ambitions, Advocates shouldn’t be mistaken for idle dreamers. People with this personality type care about integrity, and they’re rarely satisfied until they’ve done what they know to be right. Conscientious to the core, they move through life with a clear sense of their values, and they aim never to lose sight of what truly matters – not according to other people or society at large, but according to their own wisdom and intuition.",
  "typePersonality": "Advocate - INFJ-A / INFJ-T",
  "nameCamp": "Name",
  "company": "Company",
  "professional": "Professional",
  "personal": "Personal",
  "aboutme_camp": "About me",
  "personality": "Personality",
  "hobbies": "Hobbies",
  "danc": "Dance",
  "danca": "One of my main hobbies is dancing. I love ballroom dancing, my favorites are Tango, Forró, Bachata and Zouk. Since I attended a demonstration class in 2010, I was fascinated and couldn't resist, despite never having danced before, I was very clumsy and couldn't even begin a simpler step. I dedicated myself until I was able to keep up with the class and from then on I got to know many other dances, starting with Forró, Zouk and Bachata. Then I moved on to Bolero, Salsa, Samba, Tango, Soltinho, West Coast Swing (WCS), Roda de Cassino, Merengue and Kizomba. There were many years and friends made through dancing. Today I still continue, not as often as I used to, but whenever I see an opportunity to dance with my four favorites.",
  "tango": "Tango is a partner dance and social dance that originated in the 1880s along the Río de la Plata, the natural border between Argentina and Uruguay. The tango was born in the impoverished port areas of these countries from a combination of Argentine Milonga, Spanish-Cuban Habanera, and Uruguayan Candombe celebrations. It was frequently practiced in the brothels and bars of ports, where business owners employed bands to entertain their patrons. It then spread to the rest of the world. Many variations of this dance currently exist around the world. On August 31, 2009, UNESCO approved a joint proposal by Argentina and Uruguay to include the tango in the UNESCO Intangible Cultural Heritage Lists.",
  "zouk": "Brazilian zouk evolved from the partner dance known as lambada. As the Lambada music genre fell out of fashion, Lambada dancers turned to Caribbean zouk (from the Francophone, Caribbean Islands) as their preferred music. It was this transition that gave rise to the dance known as Brazilian zouk. The term Brazilian zouk was adopted to distinguish the dance style from the Caribbean zouk musical genre. Nowadays the term zouk is commonly used to refer to the Brazilian zouk dance style.",
  "forro": "Forró is a party originating in the state of Pernambuco and widespread in the Northeast Region of Brazil, very popular and common, especially during June festivals. The name of the forró party is used to name different musical genres such as xote, baião, 'arrasta-pé' and xaxado, so those who do not know their stories confuse them with a single genre. The songs are traditionally performed by three instrumentals such as accordion (Sanfona), zabumba and triangle. Forró is also one of the musical genres of the forró party, which was created by Luiz Gonzaga in 1958. The xote dance (two for there and two for here) started to accompany the music of this new genre and was called forró dance.",
  "bachata": "Bachata, also known as seresta, is a musical genre and dance that originated in the Dominican Republic in the 1960s. Considered a hybrid of bolero (above all, rhythmic bolero) with other musical influences such as cha-chá-chá and tango. The Latin American rhythm bolero in the period from 1930 to 1950 was a pleasure for the Dominican people and, with this influence, bachata was born in the late 1950s, but only in the 1980s was it recognized and launched worldwide in order to increase the tourism on the island.",
  "faroPT": "Faro is a municipality, the southernmost city and capital of the district of the same name, in the Algarve region of southern Portugal. With an estimated population of 60,995 inhabitants in 2019 (with 39,733 inhabitants in the city proper, making it the biggest city and second most populous municipality in the Algarve (after Loulé) and one of the biggest in Southern Portugal), the municipality covers an area of about 202.57 km2.",
  "lisbonPT": "Lisbon is the capital and largest city of Portugal, with an estimated population of 548,703 within its administrative limits in an area of 100 km2. Lisbon is mainland Europe's westernmost capital city (second overall after Reykjavik) and the only one along the Atlantic coast, the others (Reykjavik and Dublin) being on islands. Lisbon is one of the oldest cities in the world and the second-oldest European capital city (after Athens), predating other modern European capitals by centuries. After the fall of the Roman Empire, it was ruled by a series of Germanic tribes from the 5th century, most notably the Visigoths. Later it was captured by the Moors in the 8th century. In 1147 Afonso Henriques conquered the city and in 1255 it became Portugal's capital, replacing Coimbra. It has since been the political, economic, and cultural centre of the country.",
  "lisbon": "Lisbon",
  "london": "London",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "React",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/react.png"
      },
      {
        "name": "Python",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/python.png"
      },
      {
        "name": "Mysql",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/mysql.png"
      }
    ],
    "softSkills": [
      "Empathy",
      "Leadership",
      "Team work",
      "Agile",
      "Organized"
    ]
  },
  "language": "Languages",
  "languages": [
    "Portuguese BR (nativo)",
    "English (B1)",
    "Spanish (A1)"
  ],
  "descPortfolio": "Portfolio",
  "portfolio": [
    {
      "name": "Project carried out at DIO's bootcamp to create a Pokedex consuming an API to query pokemon information",
      "url": "https://github.com/giuanm/Pokedex",
      "github": true
    },
    {
      "name": "Project carried out at DIO's bootcamp for the creation of a portfolio page and deployed through GitHub",
      "url": "https://github.com/giuanm/js-developer-portfolio",
      "github": true
    },
    {
      "name": "Project carried out at DIO's bootcamp to create a repository search source on GitHub",
      "url": "https://github.com/giuanm/Wiki_Git.git",
      "github": true
    }
  ],
  "experience": "Professional Experience",
  "professionalExperience": [
    {
      "name": "Planning Manager / Indra - Minsait",
      "period": "08/2015 - 01/2023",
      "description": "It was a pleasure to implement projects, work and develop several analysts to have a critical sense and find solutions."
    },
    {
      "name": "Planning Manager / Plansul",
      "period": "01/2015 - 07/2015",
      "description": "Here I had my first opportunity as a manager, to work and develop a team of analysts to have a critical sense and find solutions."
    },
    {
      "name": "Planning Analyst / Indra - Minsait",
      "period": "05/2011 - 10/2014",
      "description": "In this project I started my journey as a planning analyst, putting into practice some knowledge of Statistics and improving my data analysis."
    }
  ],
  "contactForm": "Contact",
  "contact": [
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/giuan/",
      "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/giuanm",
      "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
    }
  ],
  "targetingMsg": "Where would you like to start?"
}
